In [1]:
import pandas as pd

In [5]:
data = pd.read_csv('normalization/en_train.csv')
data.head(10)

   sentence_id  token_id  class         before          after
0            0         0  PLAIN  Brillantaisia  Brillantaisia
1            0         1  PLAIN             is             is
2            0         2  PLAIN              a              a
3            0         3  PLAIN          genus          genus
4            0         4  PLAIN             of             of
5            0         5  PLAIN          plant          plant
6            0         6  PLAIN             in             in
7            0         7  PLAIN         family         family
8            0         8  PLAIN    Acanthaceae    Acanthaceae
9            0         9  PUNCT              .              .

In [3]:
data.shape

(9918441, 5)

In [6]:
filtered_data = data[data['before'].str.contains(r'\d', na=False) | data['before'].str.isupper()]
filtered_data.head()

    sentence_id  token_id     class before               after
10            1         0      DATE   2006    two thousand six
11            1         1   LETTERS   IUCN             i u c n
51            3         7      DATE   2007  two thousand seven
80            5         0      DATE   2008  two thousand eight
95            6         3  CARDINAL     91          ninety one

In [7]:
filtered_data.head(10)

,sentence_id,token_id,class,before,after
10,1,0,DATE,2006,two thousand six
11,1,1,LETTERS,IUCN,i u c n
51,3,7,DATE,2007,two thousand seven
80,5,0,DATE,2008,two thousand eight
95,6,3,CARDINAL,91,ninety one
111,8,1,DATE,4 March 2014,the fourth of march twenty fourteen
115,9,2,LETTERS,BC,b c
116,9,3,CARDINAL,3,three
143,10,8,CARDINAL,35,thirty five
147,11,1,DATE,"April 10, 2013",april tenth twenty thirteen

In [8]:
filtered_data.to_csv('normalization/filtered_output.csv', index=False)

In [9]:
filtered_data.shape

(647612, 5)

In [10]:
data['class'].unique()

array(['PLAIN', 'PUNCT', 'DATE', 'LETTERS', 'CARDINAL', 'VERBATIM',
       'DECIMAL', 'MEASURE', 'MONEY', 'ORDINAL', 'TIME', 'ELECTRONIC',
       'DIGIT', 'FRACTION', 'TELEPHONE', 'ADDRESS'], dtype=object)

In [11]:
import random
import json

# Extend and modify examples for unique and non-repetitive dataset generation
categories = [
    "PLAIN", "PUNCT", "DATE", "LETTERS", "CARDINAL", "VERBATIM", "DECIMAL", 
    "MEASURE", "MONEY", "ORDINAL", "TIME", "ELECTRONIC", "DIGIT", "FRACTION", 
    "TELEPHONE", "ADDRESS"
]

unique_data_samples = [
    {"input": "২০০১", "output": "দুই হাজার এক", "category": "DATE"},
    {"input": "আইএলও", "output": "আই এল ও", "category": "LETTERS"},
    {"input": "৩৫", "output": "পঁইত্রিশ", "category": "CARDINAL"},
    {"input": "৪৫.৭", "output": "পঁইত্রিশ দশমিক সাত", "category": "DECIMAL"},
    {"input": "১০০ মিটার", "output": "একশ মিটার", "category": "MEASURE"},
    {"input": "৳৫০০", "output": "পাঁচশ টাকা", "category": "MONEY"},
    {"input": "তৃতীয়", "output": "তৃতীয়", "category": "ORDINAL"},
    {"input": "১২:৪৫", "output": "বারোটা পঁইতাল্লিশ মিনিট", "category": "TIME"},
    {"input": "contact@domain.com", "output": "কনটাক্ট এট ডোমেইন ডট কম", "category": "ELECTRONIC"},
    {"input": "৪৫৬", "output": "চার পাঁচ ছয়", "category": "DIGIT"},
    {"input": "৩/৪", "output": "তিন চতুর্থাংশ", "category": "FRACTION"},
    {"input": "+৮৮০১৯১১২৩৪৫৬৭", "output": "প্লাস আট আট শূন্য এক নয় এক এক দুই তিন চার পাঁচ ছয় সাত", "category": "TELEPHONE"},
    {"input": "ফ্ল্যাট ৪বি", "output": "ফ্ল্যাট চার বি", "category": "ADDRESS"},
    {"input": "প্রধান সংবাদ", "output": "প্রধান সংবাদ", "category": "PLAIN"},
    {"input": "!", "output": "বিস্ময়বোধক চিহ্ন", "category": "PUNCT"}
]

# Generate unique dataset with no repetitions
large_unique_dataset = []
for _ in range(200):  # Create a large unique dataset
    sample = random.choice(unique_data_samples)
    input_variation = f"{sample['input']}_{random.randint(1, 1000)}"  # Add variation to ensure uniqueness
    large_unique_dataset.append({
        "input": input_variation,
        "output": sample["output"],
        "category": sample["category"]
    })

# Save the unique dataset to a JSON file
unique_output_path = "unique_bangla_text_normalization_dataset.json"
with open(unique_output_path, "w", encoding="utf-8") as f:
    json.dump(large_unique_dataset, f, ensure_ascii=False, indent=4)

unique_output_path

'unique_bangla_text_normalization_dataset.json'